Управление_пожарной_частью_/src/Documents/СдачаНормативов/СдачаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СдачаНормативов</name>
  <basedOn>Document.ПланСдачиНормативов</basedOn>
  <registerRecords>InformationRegister.РезультатВыполненияНормативов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Караул</name>
    <type>
      <types>CatalogRef.ГруппаСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТренировки</name>
    <type>
      <types>CatalogRef.ТипТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.МестоПроведенияТренировки</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальникКараула</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Инструктор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Нормативы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Норматив</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/InformationRegisters/РезультатВыполненияНормативов/РезультатВыполненияНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатВыполненияНормативов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Boolean</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Караул</name>
    <type>
      <types>CatalogRef.ГруппаСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТренировки</name>
    <type>
      <types>CatalogRef.ТипТренировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.МестоПроведенияТренировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Норматив</name>
    <type>
      <types>CatalogRef.Норматив</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачальникКараула</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструктор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_пожарной_частью_/src/Documents/СдачаНормативов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланСдачиНормативов") Тогда
		План = ДанныеЗаполнения.ПолучитьОбъект();

		ЭтотОбъект.Нормативы.Очистить();

		// Заполнение шапки
		Инструктор = ДанныеЗаполнения.Инструктор;
		Караул = ДанныеЗаполнения.Караул;
		МестоПроведения = ДанныеЗаполнения.МестоПроведения;
		НачальникКараула = ДанныеЗаполнения.НачальникКараула;
		Организация = ДанныеЗаполнения.Организация;
		ТипТренировки = ДанныеЗаполнения.ТипТренировки;
		// Для КАЖДОГО сотрудника из плана
		Для Каждого СтрокаСотрудник Из План.Сотрудники Цикл
			
			// Для КАЖДОГО упражнения из плана
			Для Каждого СтрокаУпражнение Из План.Упражнения Цикл
				
				// Создаем ОДНУ строку для комбинации "сотрудник × упражнение"
				НоваяСтрока = ЭтотОбъект.Нормативы.Добавить();
				НоваяСтрока.Сотрудник = СтрокаСотрудник.Сотрудник;
				НоваяСтрока.Норматив = СтрокаУпражнение.Норматив;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РезультатВыполненияНормативов
	Движения.РезультатВыполненияНормативов.Записывать = Истина;
	Для Каждого ТекСтрокаНормативы Из Нормативы Цикл
		Движение = Движения.РезультатВыполненияНормативов.Добавить();
		Движение.Период = Дата;
		Движение.ДатаПроведения = Дата;
		Движение.Организация = Организация;
		Движение.Караул = Караул;
		Движение.ТипТренировки = ТипТренировки;
		Движение.МестоПроведения = МестоПроведения;
		Движение.Норматив = ТекСтрокаНормативы.Норматив;
		Движение.НачальникКараула = НачальникКараула;
		Движение.Инструктор = Инструктор;
		Движение.Сотрудник = ТекСтрокаНормативы.Сотрудник;
		Движение.Результат = ТекСтрокаНормативы.Результат;
		Движение.Оценка = ТекСтрокаНормативы.Оценка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
